In [1]:
import pandas as pd

#import sqlite3
import sqlite3 as sq3
from sqlite3 import Connection

import sqlalchemy.pool as pool

In [5]:
#!sqlite3 mydatabase.db < synergix_dataset.sql

In [29]:
import pandas as pd
import mysql.connector
import warnings

# Filter out pandas UserWarning
warnings.filterwarnings("ignore", category=UserWarning)


# Modify these parameters according to your MySQL configuration
mysql_config = {
    'host': 'localhost',
    'database': 'food_delivery',
    'user': 'awf',
    'password': 'awf'
}

# Establish connection
connection = mysql.connector.connect(**mysql_config)


# Query to fetch table names
query = "SELECT table_name FROM information_schema.tables WHERE table_schema = %s"
table_schema = (mysql_config['database'],)  # Using the configured database name
cursor = connection.cursor()
cursor.execute(query, table_schema)

# Fetch all table names
table_names = cursor.fetchall()

# Convert the result to a pandas DataFrame for easier viewing
#df = pd.DataFrame(table_names, columns=['Table Name'])
for tb in table_names:
    print(tb)

('customers',)
('drivers',)
('food_items',)
('orders',)
('orders_items',)
('restaurants',)

In [28]:
#connection

In [38]:
query = "SELECT * FROM customers"
df = pd.read_sql(query, connection)
df.head(3)

   customer_id first_name last_name phone_number            address
0            1     Donald     Arend   9020474801  49 Madison Avenue
1            2    Richard     Krick   7040231632  32 Vineyard Drive
2            3    Pauline   Hardman   9180289990   18 Elmwood Place

In [39]:
query = "SELECT * FROM food_items"
df = pd.read_sql(query, connection)
df.head(3)

   item_id  restaurant_id          item_name       food_type price  calories
0      101             47  Coconut Ice Cream      vegetarian   NaN     500.0
1      102             93  Vegetable Pakoras             Veg   NaN    1000.0
2      103             24        Wonton soup  non-vegetarian   NaN     400.0

In [40]:
query = "SELECT * FROM restaurants"
df = pd.read_sql(query, connection)
df.head(3)

   restaurant_id restaurant_name  cuisine        address
0              1        L'Artusi  Italian  "3540 7th Ave
1              2    Loring Place  Chinese  "6947 4th Ave
2              3      Café China  Chinese  "9675 7th Ave

In [41]:
query = "SELECT * FROM drivers"
df = pd.read_sql(query, connection)
df.head(3)

   driver_id            name  rating
0          1      Avery Yost     3.1
1          2  Anthony Pegram     4.3
2          3    Elaine Kimes     4.2

In [42]:
query = "SELECT * FROM orders"
df = pd.read_sql(query, connection)
df.head(3)

,order_id,customer_id,order_date,order_time,delivered_date,delivered_time,delivery_address,driver_id,total_price,delivery_fee,discount,final_price,order_rating
0,1,7420,2022-06-01,0 days 00:03:00,2022-06-01,0 days 00:16:00,7 Cedar Lane,93,150,0.0,30.0,120.0,3.555464
1,2,1895,2022-06-01,0 days 00:04:00,2022-06-01,0 days 00:18:00,7 Lexington Place,138,9,5.0,0.0,14.0,5.000000
2,3,6651,2022-06-01,0 days 00:05:00,2022-06-01,0 days 00:20:00,20 Linden Lane,187,117,0.0,23.4,93.6,3.393489

In [43]:
df.shape

(43118, 13)

In [ ]:
# Close cursor and connection
cursor.close()
connection.close()

In [ ]:
query = "SELECT * FROM your_table"
df = pd.read_sql(query, connection)

In [2]:
db = sq3.connect("synergix_dataset.sql")

cursor = db.cursor()

cursor.execute("SELECT * FROM sqlite_master;")

available_table=(cursor.fetchall())
available_table

[]